13/data/attachments/16070ec9d87dff9d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_76ffa7ac-e1c7-4c72-9987-bf5304e710e8</nif:username>
            <nif:friendToBeAdded>Samantha_traditional_Friend_59558_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>